# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent

* CATP #02

1. Elaborar a função =lst_vezes=, que recebe uma lista e um número. Ela
   deve retornar uma nova lista cujos elementos são o resultado de sua
   multiplicação pelo número passado. Exemplo:

   #+begin_src R :results output :session :exports both
   lst_vezes(list(1, 2, 3), 2);
   #+end_src

   #+RESULTS:
   : [1] 2 4 6

2. Elaborar a função =inverte_lst=, que recebe uma lista e a retorna
   invertida. Exemplo:

   #+begin_src R :results output :session :exports both
   inverte_lst(list(1,2,3,4,5,6));
   #+end_src

   #+RESULTS:
   : [1] 6 5 4 3 2 1

3. Elaborar a função =pow_lst=, que recebe uma lista e um número,
   retornando uma lista com os elementos elevados ao número recebido.

   #+begin_src R :results output :session :exports both
   pow_list(list(1,2,3,4,5,6), 2)
   #+end_src

   #+RESULTS:
   : [1]  1  4  9 16 25 36
